# Pandas II

Pandas is a python library that provides high-performance data manipulation and analysis tools. To use it, We need to import it as

In [1]:
import pandas as pd

In the following link, you will be able to download a dataset that contains infromation about different characteristics of automobiles, such as body-style, wheel-base, engine-type, price, mileage, horsepower and many more. 

https://raw.githubusercontent.com/jnin/information-systems/main/data/Automobile_data.csv

Usually, we would download the file and save it, and then **open it in Anaconda**. However for this notebook we will load it directly from the website using the following code:

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/jnin/information-systems/main/data/Automobile_data.csv', sep=',', index_col='index')

Do not worry about the previous line. We haven't seen this statement in class. Therefore, you are not supposed to know this. For your undestanding, the `.read_csv()` function reads all the content in a file and saves it in a DataFrame. If you type `df` you should obtain something like this

In [3]:
df

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...
81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

<div class="alert alert-info"><b>  Exercise 1 </b>

Visualize the first 7 rows of the data frame using the function ```head()``` and retrive the number of rows and columns using ```.shape```

</div>

In [4]:
<FILL IN>

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0

In [5]:
<FILL IN>

(61, 9)

<div class="alert alert-info"><b>  Exercise 2 </b>

Display all columns names using ```.columns```. Now, retrieve the column name ```'wheel-base``` using its column's index. Finally, traverse all columns' name with a for loop.

</div>

In [6]:
<FILL IN>

Index(['company', 'body-style', 'wheel-base', 'length', 'engine-type',
       'num-of-cylinders', 'horsepower', 'average-mileage', 'price'],
      dtype='object')

In [7]:
<FILL IN>

'wheel-base'

<div class="alert alert-info"><b>  Exercise 3 </b>

Slicing in Pandas is very flexible, remember you can use ```loc[]``` or ```iloc[]``` to slice columns. Use both options to select the ```body-style``` column and then ```['horsepower','price']```. 

</div>

In [8]:
<FILL IN>

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0

<div class="alert alert-info"><b>  Exercise 4 </b>

The loc and iloc statements can select more than one column. Use both to select the ```['horsepower','price']``` columns at the same time. 

</div>

In [9]:
<FILL IN>

       horsepower    price
index
0             111  13495.0
1             111  16500.0
2             154  16500.0
3             102  13950.0
4             115  17450.0
...           ...      ...
81             85   7975.0
82             52   7995.0
86            100   9995.0
87            114  12940.0
88            114  13415.0

[61 rows x 2 columns]

<div class="alert alert-info"><b>  Exercise 5 </b>

Now, let's also slice the DataFrame ```df``` using loc and iloc. To do so, select rows 5 to 10 and columns ```num-of-cylinders``` and ```horsepower```.

</div>

In [10]:
<FILL IN>

       horsepower  average-mileage
index
4             115               18
5             110               19
6             110               19
9             101               23
10            101               23
11            121               21

<div class="alert alert-info"><b>  Exercise 6 </b>

As explained in the Pandas videos, a single column DataFrame is considered a Series. Slice the column ```'body-style'``` and check its type.

</div>

In [11]:
<FILL IN>

pandas.core.series.Series

<div class="alert alert-info"><b>  Exercise 7 </b>

There is a Pandas function named `.value_counts()` that when applied to a column returns a count of the entries for each of the unique values of that column. Use this function to find the company with more cars, as well as to study the different types of engines.

</div>

In [12]:
<FILL IN>

company
toyota           7
bmw              6
mazda            5
nissan           5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
chevrolet        3
honda            3
isuzu            3
jaguar           3
porsche          3
dodge            2
volvo            2
Name: count, dtype: int64

In [13]:
<FILL IN>

engine-type
ohc      46
dohc      5
ohcv      5
ohcf      2
l         1
rotor     1
dohcv     1
Name: count, dtype: int64

<div class="alert alert-info"><b>  Exercise 8 </b>

Find the most expensive auto's company name and price.

</div>

In [14]:
<FILL IN>

             company    price
index
47     mercedes-benz  45400.0

<div class="alert alert-info"><b>  Exercise 9 </b>

Select only the cars made by Toyota.

</div>

In [15]:
<FILL IN>

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

<div class="alert alert-info"><b>  Exercise 10 </b>

Find the minimum and maximum ```horsepower``` for the cars made by ```Toyota```.

</div>

In [17]:
<FILL IN>

62

<div class="alert alert-info"><b>  Exercise 11 </b>

Create a new column called ```avg_price_per_cv``` with the average ```price``` per ```horsepower``` for each car.

</div>

In [19]:
<FILL IN>

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,avg_price_per_cv
index,,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0,121.576577
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0,148.648649
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0,107.142857
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,136.764706
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,151.739130
...,...,...,...,...,...,...,...,...,...,...
81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0,93.823529
82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0,153.750000
86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0,99.950000
87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0,113.508772
88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0,117.675439

<div class="alert alert-info"><b>  Exercise 12 </b>

Drop the column ```average-mileage``` using the function ```.drop()``` and observe if the column has been dropped. Then apply again the function drop but using the parameter ```inplace=True```. Can you observe any difference?

</div>

In [20]:
<FILL IN>

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,price,avg_price_per_cv
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,13495.0,121.576577
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,16500.0,148.648649
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,16500.0,107.142857
3,audi,sedan,99.8,176.6,ohc,four,102,13950.0,136.764706
4,audi,sedan,99.4,176.6,ohc,five,115,17450.0,151.739130
...,...,...,...,...,...,...,...,...,...
81,volkswagen,sedan,97.3,171.7,ohc,four,85,7975.0,93.823529
82,volkswagen,sedan,97.3,171.7,ohc,four,52,7995.0,153.750000
86,volkswagen,sedan,97.3,171.7,ohc,four,100,9995.0,99.950000
87,volvo,sedan,104.3,188.8,ohc,four,114,12940.0,113.508772
88,volvo,wagon,104.3,188.8,ohc,four,114,13415.0,117.675439

<div class="alert alert-info"><b>  Exercise 13 </b>

Compute the price of the most expensive car for each of the companies. The expected outcome is:

```
company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64
```

</div>

In [23]:
<FILL IN>

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

<div class="alert alert-info"><b>  Exercise 14 </b>

compute the average car price for each company. To do this you can use the function ```.groupby()``` in combination with an agregation function such as ```.mean()```.

</div>

In [24]:
<FILL IN>

company
alfa-romero      15498.333333
audi             16392.500000
bmw              27213.333333
chevrolet         6007.000000
dodge             6303.000000
honda            10195.000000
isuzu             6785.000000
jaguar           34600.000000
mazda             9654.800000
mercedes-benz    35040.000000
mitsubishi        6689.000000
nissan            8289.000000
porsche          35528.000000
toyota            8216.857143
volkswagen        8435.000000
volvo            13177.500000
Name: price, dtype: float64

<div class="alert alert-info"><b>  Exercise 15  </b>
Now compute the average price for each company and body-style combination

</div>


<div class="alert alert-warning">

Hint: You can groupby data using more than one column at the same time

</div>

In [25]:
<FILL IN>

company        body-style
alfa-romero    convertible    14997.500000
               hatchback      16500.000000
audi           sedan          15550.000000
               wagon          18920.000000
bmw            sedan          27213.333333
chevrolet      hatchback       5723.000000
               sedan           6575.000000
dodge          hatchback       6303.000000
honda          sedan          11645.000000
               wagon           7295.000000
isuzu          sedan           6785.000000
jaguar         sedan          34600.000000
mazda          hatchback       7482.500000
               sedan          18344.000000
mercedes-benz  hardtop        45400.000000
               sedan          33256.000000
               wagon          28248.000000
mitsubishi     hatchback       5789.000000
               sedan           7589.000000
nissan         sedan           8524.000000
               wagon           7349.000000
porsche        convertible    37028.000000
               hardtop        34028.000000
               hatchback               NaN
toyota         hatchback       6058.000000
               wagon           9836.000000
volkswagen     sedan           8435.000000
volvo          sedan          12940.000000
               wagon          13415.000000
Name: price, dtype: float64

<div class="alert alert-info"><b>  Exercise 16 </b>

Now, let's compute some statistics for each ```company```. Use the function ```.groupby()``` to compute the min, mean and max values for the columns: ```price```,  ```horsepower``` and ```length```.

</div>

In [26]:
<FILL IN>

                      price  horsepower      length
company
alfa-romero    15498.333333  125.333333  169.600000
audi           16392.500000  109.250000  180.800000
bmw            27213.333333  144.833333  185.033333
chevrolet       6007.000000   62.666667  151.933333
dodge           6303.000000   68.000000  157.300000
honda          10195.000000   92.333333  167.200000
isuzu           6785.000000   72.666667  160.833333
jaguar         34600.000000  204.666667  196.966667
mazda           9654.800000   75.400000  164.260000
mercedes-benz  35040.000000  153.500000  197.275000
mitsubishi      6689.000000   78.000000  164.850000
nissan          8289.000000   82.800000  170.140000
porsche        35528.000000  234.000000  171.166667
toyota          8216.857143   75.428571  167.571429
volkswagen      8435.000000   72.250000  171.700000
volvo          13177.500000  114.000000  188.800000

<div class="alert alert-info"><b>  Exercise 17 </b>

If you inspect the data, the ```number of cylinders``` column displays this value in string form. However, in the future, we might need to operate with this value and therefore would like to convert this to an integer. To solve this issue, we will first check how many different values of the num-of-cylinders are there. 

</div>

<div class="alert alert-warning">

Hint: You can use the `.unique()` function

</div>

In [27]:
<FILL IN>

array(['four', 'six', 'five', 'three', 'twelve', 'two', 'eight'],
      dtype=object)